In [18]:
import pandas as pd

In [19]:
df = pd.read_csv('cafe.csv')
df.head(2)

      메뉴    가격  칼로리
0  아메리카노  4500   10
1   카페라떼  5000  110

In [20]:
df['new'] = 0
df.head(2)

      메뉴    가격  칼로리  new
0  아메리카노  4500   10    0
1   카페라떼  5000  110    0

In [21]:
discount = 0.2
df['할인가'] = df['가격'] * (1-discount)
df.head(2)

      메뉴    가격  칼로리  new     할인가
0  아메리카노  4500   10    0  3600.0
1   카페라떼  5000  110    0  4000.0

In [22]:
# 행삭제

In [23]:
df = df.drop(1,axis=0); #axis = 0 // 행삭제 1은 컬럼삭제
df.head(2)

      메뉴    가격  칼로리  new     할인가
0  아메리카노  4500   10    0  3600.0
2   카페모카  5500  250    0  4400.0

In [24]:
df = df.drop('칼로리',axis = 1)
df.head(3)

      메뉴    가격  new     할인가
0  아메리카노  4500    0  3600.0
2   카페모카  5500    0  4400.0
3   카푸치노  5000    0  4000.0